Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །ལྷ་ཅིག་ལྷ་མཆོག་བལྟམ་ཞིང་དེ་དག་བཙས་པས་རྒྱལ་ཁབ་ཕུན་སུམ་ཚོགས།
en: As the supreme god is born, so are these other beings. How excellent for the kingdom! “Go, king, look upon all that is yours! Lord of shining merit!

source: །རྗེ་ཅིག་རྒྱལ་པོར་གཤེགས་ཏེ་བསོད་ནམས་གཟི་འོད་ལྡན་པ་བལྟམ་པ་ཡི།
en: As thousands of joyous gods and humans see the qualities of the newborn,

source: །ཡོན་ཏན་དག་ནི་མཐོང་བར་གྱུར་ནས་ལྷ་དང་མི་རྣམས་སྟོང་བགྲངས་པ། །རབ་ཏུ་དགའ་བར་གྱུར་དང་ཀུན་ལ་ཉིད་ཀྱིས་ལེགས་པར་གཟིགས་སུ་གསོལ།
en: They set out for perfect awakening beyond suffering And call out, ‘May all be successful!’ ”

source: །མྱུར་དུ་རྒྱལ་གྱུར་ཅིག་ཅེས་བྱང་ཆུབ་དམ་པ་མྱ་ངན་མེད་པར་ཞུགས།
en: Monks, at the time of the Bodhisattva’s birth, a great show of generosity was instigated.

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བཙས་པ་དང་སྐད་ཅིག་དེ་ལ་སྦྱིན་པ་གཏོང་བ་ཡང་དེ་བས་རྒྱ་ཆེར་གྱུར་ཏོ།
en: Moreover, five hundred children of noble family were born.

source: །ཡ་རབས་ཀྱི་རིགས་ལྔ་བརྒྱ་ཡང་བཙས་པར་གྱུར་ཏོ།
en: Ten thousand girls, headed by Yaśovatī, were also born, as well as eight hundred female servants and five hundred male servants, headed by Chanda. Likewise ten thousand mares and ten thousand colts, headed by Kaṇṭhaka, were born. Finally five hundred female elephants and five hundred male elephants were born following the Bodhisattva’s birth. These births were all recorded in registers by King Śuddhodana and given to his young son for entertainment.

source: །གྲགས་ལྡན་ལ་སོགས་པ་བུ་མོ་ཁྲི་དང་། བྲན་མོ་བརྒྱད་བརྒྱ་དང་། འདུན་པ་ལ་སོགས་པ་བྲན་ལྔ་བརྒྱ་དང་། རྟེའུ་མོ་ཁྲི་དང་། བསྔགས་ལྡན་ལ་སོགས་པ་རྟེའུ་ཕོ་ཁྲི་དང་། བ་ལང་གི་ཕྲུག་གུ་མོ་ལྔ་བརྒྱ་དང་། བ་ལང་གི་ཕྲུག་གུ་ཕོ་ལྔ་བརྒྱ་པོ་དག་ཀྱང་བཙས་ཤིང་འབྲངས་པར་གྱུར་ནས་དེ་དག་ཐམས་ཅད་རྒྱལ་པོ་ཟས་གཙང་མས་སྣ་གྲངས་ཡི་གེར་བྲིས་ཏེ་སྲས་བུ་གཞོན་ནུ་རྩེན་པའི་ཕྱིར་བྱིན་པར་གྱུར་ཏོ།
en: Through the power of the Bodhisattva and for his enjoyment, a bodhi tree grew at the center of the four billion regions, while a sandalwood-tree forest grew at the inner region.

source: །བྱང་ཆུབ་སེམས་དཔའི་ལོངས་སྤྱོད་ཀྱི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱི་མཐུས་གླིང་བྱེ་བ་བརྒྱ་ཕྲག་བཞིའི་དབུས་ཀྱིས་ཕྱོགས་ནས་ཨ་ཤྭད་ཐའི་སྡོང་པོ་སྐྱེས་པར་གྱུར་ཏོ། །གླིང་ཕྲ་མོ་རྣམས་སུ་ཡང་ཙན་དན་གྱི་ནགས་ཚལ་སྐྱེས་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའི་ལོངས་སྤྱོད་ཀྱི་དོན་དུ་གྲོང་ཁྱེར་གྱི་ཁོ་ར་ཡུག་ཏུ་ཡང་སྐྱེད་མོས་ཚལ་ལྔ་བརྒྱ་དག་བྱུང་བར་གྱུར་ཏོ།
en: Also for the Bodhisattva’s enjoyment, five hundred parks sprang forth in the area surrounding the city.

source: །གཏེར་ལྔ་སྟོང་ཡང་སའི་འོག་ནས་གྱེན་དུ་འབུས་ཏེ་སྒོ་སྟོན་པར་གྱུར་ཏོ།
en: The entrances to five thousand treasures became visible as they broke forth from the earth.

source: །དེ་ལྟར་རྒྱལ་པོ་ཟས་གཙང་མ་དེའི་དོན་བསམ་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་གྱུར་ནས་རྒྱལ་པོ་ཟས་གཙང་མ་འདི་སྙམ་དུ་བདག་གི་བུ་གཞོན་ནུ་དེའི་མིང་ཇི་སྐད་ཅིག་གདགས་པར་བྱ་སྙམ་པ་དང་། དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Thus all of King Śuddhodana’s intentions were perfectly fulfilled. Then the king wondered, “Now, what shall I name my young son?

source: བུ་འདི་སྐྱེས་མ་ཐག་ཏུ་བདག་གི་དོན་ཐམས་ཅད་ཡང་དག་པར་གྲུབ་པར་གྱུར་གྱིས། འདིའི་མིང་ནི་དོན་ཐམས་ཅད་གྲུབ་པར་གདགས་སོ་སྙམ་སྟེ། དེ་ནས་རྒྱལ་པོ་ཟས་གཙང་མས་བྱང་ཆུབ་སེམས་དཔའ་ལ་རིམ་གྲོ་ཆེར་བྱས་ནས་བུ་འདིའི་མིང་དོན་ཐམས་ཅད་གྲུབ་པ་ཞེས་བྱའོ་ཞེས་མིང་དུ་བཏགས་སོ།
en: Well, immediately when my son was born, all of my aims were fulfilled, so I will name him Sarvārthasiddha, Fulfiller of All Aims.” Then King Śuddhodana arranged a great naming ceremony and announced, “This child’s name is Sarvārthasiddha.”

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བཙས་ནས་མའི་གློ་གཡས་པ་ཡང་མ་རལ་མ་ཉམས་ཤིང་སྔོན་བཞིན་དུ་གྱུར་ཏོ།
en: Monks, although the Bodhisattva had now been born, his mother’s right side was not torn or damaged but had returned to its usual state.

source: །དེར་ཁྲོན་པ་ལན་གསུམ་ལྡུད་པ་དག་ཀྱང་བྱུང་བར་གྱུར། སྤོས་ཀྱི་འབྲུ་མར་གྱི་རྫིང་བུ་དག་ཀྱང་བྱུང་བར་གྱུར་ཏོ།
en: Moreover, Trita’s wells manifested with flowing waters, and three ponds of scented oil sprang forth.

source: །དེ་ནས་ལྷའི་བུ་མོ་ལྔ་སྟོང་དག་ལྷའི་སྤོས་ཀྱིས་བསྒོས་པའི་འབྲུ་མར་དྲི་ཞིམ་པོ་ཁྱེར་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་མའི་དྲུང་དུ་ལྷག་ནས། བལྟམས་པ་ལེགས་པར་བལྟམ་མམ། སྐུ་ལ་མི་བདེ་བ་མ་མཆིས་སམ། ཞེས་འདྲི་བར་གྱུར་ཏོ།
en: Then five thousand celestial maidens came before the Bodhisattva’s mother, bringing fragrant oils perfumed with the scent of celestial perfumes. They wanted to know how the birth had gone and whether she was feeling weary.

source: །ལྷའི་བུ་མོ་ལྔ་སྟོང་དག་ཀྱང་ལྷའི་བྱུག་པ་དང་། རྣམ་པར་བྱུག་པ་ཐོགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་མའི་དྲུང་དུ་ལྷགས་ནས་བལྟམ་པ་ལེགས་པར་བལྟམ་མམ། སྐུ་ལ་མི་བདེ་བ་མ་མཆིས་སམ། ཞེས་འདྲི་བར་གྱུར་ཏོ།
en: Likewise five thousand celestial maidens bearing unguents came before the Bodhisattva’s mother and asked how the birth was and whether she was weary.

source: །ལྷའི་བུ་མོ་ལྔ་སྟོང་དག་ཀྱང་ལྷའི་སྤོས་ཆུས་བཀང་བའི་བུམ་པ་ཐོགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་མའི་དྲུང་དུ་ལྷགས་ནས་བལྟམ་པ་ལེགས་པར་བལྟམ་མམ། སྐུ་ལ་མི་བདེ་བ་མ་མཆིས་སམ་ཞེས་འདྲི་བར་གྱུར་ཏོ།
en: Then five thousand celestial maidens bearing vases filled with water scented with celestial perfumes came before the Bodhisattva’s mother and asked how the birth was and whether she was weary.

source: །ལྷའི་བུ་མོ་ལྔ་སྟོང་དག་ཀྱང་ལྷའི་བྱིས་པའི་གོས་ཐོགས་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་མའི་དྲུང་དུ་ལྷགས་ནས་བལྟམ་པ་ལེགས་པར་བལྟམ་མམ། སྐུ་ལ་མི་བདེ་བ་མ་མཆིས་སམ་ཞེས་འདྲི་བར་གྱུར་ཏོ།
en: Next five thousand celestial maidens bearing divine children’s clothing came before the Bodhisattva’s mother and asked how the birth was and whether she was weary.

source: །ལྷའི་བུ་མོ་ལྔ་སྟོང་དག་ཀྱང་ལྷའི་བྱིས་པའི་རྒྱན་ཐོགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་མའི་དྲུང་དུ་ལྷགས་ནས་བལྟམ་པ་ལེགས་པར་བལྟམ་མམ། སྐུ་ལ་མི་བདེ་བ་མ་མཆིས་སམ་ཞེས་འདྲི་བར་གྱུར་ཏོ།
en: Then five thousand celestial maidens bearing divine children’s ornaments came before the Bodhisattva’s mother and asked how the birth was and whether she was weary.

source: །ལྷའི་བུ་མོ་ལྔ་སྟོང་དག་ཀྱང་གླུ་དབྱངས་ལེན་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་མའི་དྲུང་དུ་ལྷགས་ཏེ་བལྟམ་པ་ལེགས་པར་བལྟམ་མམ། སྐུ་ལ་མི་བདེ་བ་མ་མཆིས་སམ་ཞེས་འདྲི་བར་གྱུར་ཏོ།
en: Finally five thousand celestial maidens singing and playing divine instruments came before the Bodhisattva’s mother and asked how the birth was and whether she was weary.

source: །འཛམ་བུའི་གླིང་འདི་ན་ཕྱི་རོལ་གྱི་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་ཇི་སྙེད་ཅིག་འཁོད་པ་དེ་དག་ཐམས་ཅད་ནམ་མཁའ་ལས་འོངས་ཏེ། རྒྱལ་པོ་ཟས་གཙང་མའི་མདུན་དུ་འཁོད་ནས།
en: All of the extremist sages from Jambudvīpa who possessed the five extraordinary abilities came flying through the sky and arrived before King Śuddhodana.

source: རྒྱལ་པོ་འཕེལ་བར་གྱུར་ཅིག་ཅེས་བྱ་བའི་སྒྲ་སྒྲོག་པར་གྱུར་ཏོ།
en: They called out, “May the king thrive!”

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བཙས་ནས་ཞག་བདུན་དུ་ལུམ་བི་ནིའི་ནགས་ཚལ་དུ་ལྷ་དང་མིའི་སིལ་སྙན་དང་། ཕེག་རྡོབ་པས་རིམ་གྲོར་བྱས་སོ། །བཀུར་སྟིར་བྱས་སོ། །བསྟི་སྟང་དུ་བྱས་སོ། །མཆོད་པར་བྱས་སོ།
en: Monks, for seven days following the Bodhisattva’s birth, he was honored with celestial and human music, respected, revered, and given various offerings in the Lumbinī Grove.

source: །བཟའ་བ་དང་། བཅའ་བ་དང་། མྱང་བ་དག་ཀྱང་དྲངས་པར་གྱུར་ཏོ།
en: Food, drink, and enjoyments were proffered.

source: །ཤཱཀྱའི་ཚོགས་ཐམས་ཅད་ཀྱང་འདུས་ནས་ཀུན་དགའ་བའི་སྒྲ་བརྗོད་པར་གྱུར་ཏོ། །སྦྱིན་པ་དག་ཀྱང་བྱིན་ནོ། །བསོད་ནམས་དག་ཀྱང་བྱེད་དོ། །བྲམ་ཟེ་སུམ་ཁྲི་ཉིས་སྟོང་ཡང་ཉིན་གཅིག་བཞིན་དུ་ཚིམ་པར་བྱས་སོ།
en: The entire Śākya clan gathered, and everyone called out with delight, practiced generosity, engaged in merit, and satisfied the needs of 32,000 priests each day.

source: །སུ་དག་ཅི་འདོད་པ་དེ་དག་ལ་ཡང་དེ་བྱིན་པར་གྱུར་ཏོ།
en: They gave anything that was desired to whoever desired it.

source: །བརྒྱ་བྱིན་དང་ཚངས་པ་ཡང་བྲམ་ཟེའི་འཁོར་དེར་བྲམ་ཟེའི་ཁྱེའུའི་གཟུགས་སུ་སྤྲུལ་ཏེ་གྲལ་གྱི་ཐོག་མ་ལ་འཁོད་ནས་བཀྲ་ཤིས་ཀྱི་ཚིགས་སུ་བཅད་པ་འདི་དག་བརྗོད་པར་གྱུར་ཏོ།
en: Śakra and Brahmā also manifested themselves in the form of young priests within that gathering of priests and, sitting at the head of the line, they sang these verses of auspiciousness:

source: །ཇི་ལྟར་ངན་སོང་རྣམས་ཞི་ཞིང་།
en: “As the lower realms are pacified,

source: །ཇི་ལྟར་འགྲོ་ཀུན་བདེ་ལས་ན།
en: As all beings feel joy,

source: །འགྲོ་ལ་བདེ་བ་འགོད་པ་ཡི།
en: He Who Will Establish Beings in Happiness,

source: །བདེ་བ་མཛད་ཅིག་བལྟམ་པར་མངོན།
en: The Bringer of Joy, has been born!

source: །ཇི་ལྟར་རབ་རིབ་མེད་འོད་ཀྱིས།
en: “As the unclouded lights

source: །ལྷ་དང་ཉི་ཟླའི་འོད་རྣམས་ཀྱང་།
en: Of the gods, the sun, and the moon

source: །མི་སྣང་ཟིལ་དུ་རླག་པ་ལས།
en: Are outshone and disappear,

source: །བསོད་ནམས་འོད་ཅིག་བྱུང་བར་མངོན།
en: A light of merit has certainly appeared!

source: །མིག་མེད་རྣམས་ཀྱང་མཐོང་གྱུར་ཅིང་།
en: “The blind can see again;

source: །རྣ་བ་འོན་པས་སྒྲ་ཐོས་ལ།
en: The deaf can hear again;

source: །སྨྱོན་པ་རྣམས་ཀྱང་དྲན་ལྡན་ལས།
en: The insane have had their sanity restored.

source: །འཇིག་རྟེན་མཆོད་རྟེན་འགྱུར་བར་མངོན།
en: He will become an object of worship for the world!

source: །ཇི་ལྟར་ཉོན་མོངས་མི་གནོད་ཅིང་།
en: “Since, unharmed by negative emotions,

source: །འགྲོ་བ་བྱམས་པའི་ཡིད་གྱུར་ལས། །ཚངས་པ་བྱེ་བས་མཆོད་འོས་སུ། །གདོན་མི་ཟ་བར་འགྱུར་བར་མངོན།
en: The minds of beings are filled with love, It is certain, without a doubt, That he will become worthy of the offerings of ten million Brahmās.

source: །ས་ལ་མེ་ཏོག་རྒྱས་གྱུར་ཅིང་།
en: “As sāl trees blossom

source: །ས་ཡང་མཉམ་པར་གནས་པ་ལས། །
en: And the earth is even,

source: འགྲོ་བ་ཀུན་གྱིས་མཆོད་པ་ཡི། །ཐམས་ཅད་མཁྱེན་དུ་འགྱུར་བར་མངོན།
en: Certainly he will become omniscient, The recipient of offerings of all the world.

source: །ཇི་ལྟར་འཇིག་རྟེན་འཁྲུག་མེད་ཅིང་།
en: “Since the world is calm

source: །པད་མ་ཆེན་པོ་འཐོན་པ་ལས།
en: And great lotuses have sprouted forth,

source: །ངེས་པར་གཟི་བརྗིད་ཆེན་པོ་འདི།
en: Certainly this splendorous one

source: །འཇིག་རྟེན་མགོན་དུ་བྱོན་པར་འགྱུར།
en: Will be the protector of the world!

source: །ལྷ་ཡི་སྤོས་ཀྱིས་སྤགས་གྱུར་པ། །འཇམ་པའི་རླུང་གི་ངད་ལྡང་ཞིང་།
en: “Since gentle fragrant breezes Perfumed with divine incense

source: །སེམས་ཅན་ནད་རྣམས་ཞི་གྱུར་ལས།
en: Pacify the illnesses of beings,

source: །འདི་ནི་སྨན་པའི་རྒྱལ་པོར་བྱོན།
en: He will become the king of physicians.

source: །གཟུགས་ཁམས་གནས་པའི་ལྷ་བརྒྱ་པོ།
en: “As the hundred gods living in the form realm,

source: །འདོད་ཆགས་བྲལ་བ་འདི་དག་ཀྱང་།
en: Who are free of desire,

source: །ཐལ་མོ་སྦྱར་ཞིང་འདུད་པ་ལས།
en: Join their palms and bow down,

source: །འདི་ནི་སྦྱིན་པའི་གནས་སུ་བྱོན།
en: He will become worthy of veneration!

source: །མི་རྣམས་ཀྱིས་ནི་ལྷ་མཐོང་ཞིང་།
en: “Humans can see the gods,

source: །ལྷ་རྣམས་ཀྱིས་ནི་མི་མཐོང་ཡང་།
en: And gods can see humans,

source: །ཕན་ཚུན་འཚེ་བ་མེད་པ་ལས།
en: Yet they are without animosity toward one another;

source: །འདི་ནི་དེད་དཔོན་ཆེན་པོར་བྱོན།
en: Thus he will become the great leader!

source: །མེ་རྣམས་ཞི་བར་གནས་གྱུར་ཅིང་།
en: “Since all fires have died out,

source: །ཆུ་ཀླུང་ཐམས་ཅད་མི་གཡོ་ལ།
en: And all flowing rivers are still,

source: །ས་ཡང་དལ་བུས་གཡོ་བ་ལས།
en: And the earth sways gently,

source: །འདི་ནི་ཡང་དག་གཟིགས་པར་འགྱུར།
en: He will be one who sees the truth!”

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བཙས་ནས་ཞག་བདུན་ལོན་པ་དང་། ལྷ་མོ་སྒྱུ་འཕྲུལ་ཤི་བའི་དུས་བྱས་པར་གྱུར་ཏེ།
en: Monks, seven days after the Bodhisattva was born, the time came for Māyādevī to pass away.

source: དེ་ཤི་བའི་དུས་བྱས་ནས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་ནང་དུ་སྐྱེས་སོ།
en: Upon her death, she was born among the gods in the Heaven of the Thirty-Three.

source: །དགེ་སློང་དག་ཁྱེད་འདི་སྙམ་དུ་བྱང་ཆུབ་སེམས་དཔའི་ལན་བོན་གྱིས་ལྷ་མོ་སྒྱུ་འཕྲུལ་འཆི་བའི་དུས་བྱས་སོ། །སྙམ་ན་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེའི་ཚེའི་ཚད་ནི་མཐར་ཐུག་པའི་ཕྱིར་རོ།
en: Monks, you may think that it was because of the Bodhisattva that Māyādevī died. But you should not look upon things that way, since she had reached the maximum extent of her lifespan.

source: །དགེ་སློང་དག་འདས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་བཙས་ནས་ཞག་བདུན་ལོན་ན་མ་འཆི་བའི་དུས་བྱས་པར་གྱུར་ཏོ།
en: Monks, seven days after the bodhisattvas of the past were born, their mothers also died.

source: བྱང་ཆུབ་སེམས་དཔའ་སྐྱེས་ཏེ་དབང་པོ་ཡོངས་སུ་རྫོགས་ནས་མངོན་པར་བྱུང་ན་མ་སྙིང་འགས་སུ་འོང་བའི་ཕྱིར་རོ།
en: Because once a bodhisattva is born and has grown up, it would destroy his mother’s heart if he were to renounce his home.

source: །དགེ་སློང་དག་དེ་ལྟར་ཞག་བདུན་ལོན་ནས་ཐོག་མ་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་ལྷ་མོ་སྒྱུ་འཕྲུལ་བཀོད་པ་ཇི་ལྟ་བུས་སྐྱེད་མོས་ཚལ་གྱི་སར་ཞུགས་པར་གྱུར་པ་དེ་དག་ལས་བྱེ་བ་བརྒྱ་སྟོང་གྱུར་པས་ཀྱང་ལྷག་པའི་བཀོད་པ་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའ་གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་སུ་ཞུགས་སོ།
en: Monks, seven days earlier Māyādevī had gone in great pomp from the city of Kapilavastu to the pleasure grove. However, with a splendor one trillion times greater than that, the Bodhisattva now entered the city of Kapilavastu.

source: །དེ་ཞུགས་པ་དང་། བུམ་པ་སྤོས་ཆུས་གང་བ་ལྔ་སྟོང་གིས་མདུན་དུ་དྲངས་པར་གྱུར་ཏོ།
en: When he entered, five thousand vases filled with scented water were carried ahead of him.

source: །དེ་བཞིན་དུ་བུ་མོ་ལྔ་སྟོང་ནི་རྨ་བྱའི་མདོངས་ལག་ན་ཐོགས་ཏེ་མདུན་དུ་འདོང་བར་གྱུར་ཏོ། །བུ་མོ་ལྔ་སྟོང་ནི་ཤིང་ཏ་ལའི་ཡལ་ག་ཐོགས་ཤིང་མདུན་དུ་འདོང་བར་གྱུར་ཏོ།
en: Likewise five thousand maidens carrying fans made of peacock feathers walked ahead.

source: །བུ་མོ་ལྔ་སྟོང་ནི་སྤོས་ཆུའི་རིལ་བ་བྷྲིང་ག་ར་ཐོགས་ཏེ་ལམ་ཆག་ཆག་གིས་འདེབས་ཤིང་མདུན་དུ་འདོང་བར་གྱུར་ཏོ།
en: Five thousand maidens waving palm fronds preceded them, and farther ahead came five thousand maidens holding golden vases of scented water, who sprinkled this water upon the path.

source: །བུ་མོ་ལྔ་སྟོང་ནི་ནགས་ཚལ་གྱི་མེ་ཏོག་གི་ཕྲེང་བ་འཕྱང་བ་ཁྱེའུ་ཚང་སྣ་ཚོགས་ཐོགས་ཏེ་མདུན་དུ་འདོང་བར་གྱུར་ཏོ།
en: They were preceded by five thousand maidens holding various fresh garlands of wildflowers, as well as five thousand maidens carrying various boxes.

source: །བུ་མོ་ལྔ་སྟོང་ནི་བཟང་པོར་སྒྱུར་བའི་རིན་པོ་ཆེ་ཐོགས་ཏེ། ལམ་གྱི་བྱི་དོར་བྱེད་ཅིང་མདུན་དུ་འདོང་བར་གྱུར་ཏོ།
en: Then came five thousand maidens holding fine jewels and sweeping the path.

source: །བུ་མོ་ལྔ་སྟོང་ནི་སྟན་བཟང་པོ་ཐོགས་ཤིང་མདུན་དུ་འདོང་བར་གྱུར་ཏོ། །བྲམ་ཟེ་ལྔ་སྟོང་ནི་དྲིལ་བུ་ཐོགས་ཏེ་བཀྲ་ཤིས་ཀྱི་སྒྲ་འབྱིན་ཅིང་མདུན་དུ་འདོང་བར་གྱུར་ཏོ།
en: Farther ahead walked five thousand maidens carrying beautiful cushions, and five thousand priests carrying bells and ringing out sounds of auspiciousness.

source: །གླང་པོ་ལྔ་སྟོང་ནི་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་ཏེ་མདུན་དུ་འདོང་བར་གྱུར་ཏོ།
en: In front of them there were five thousand beautifully decorated elephants.

source: །རྟ་ཉིས་ཁྲི་ནི་གསེར་གྱི་བརྒྱན་གྱིས་བཀབ་ཅིང་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་ཏེ་མདུན་དུ་འདོང་བར་གྱུར་ཏོ།
en: Then came twenty thousand horses covered with golden ornaments and full of jewels.

source: །ཤིང་རྟ་བརྒྱད་ཁྲི་ནི་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་ཞིང་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བས་ལེགས་པར་བརྒྱན་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཕྱི་བཞིན་འདོང་བར་གྱུར་ཏོ། །རྐང་ཏང་དཔའ་ཞིང་རྟུལ་ཕོད་པ། ཡན་ལག་དམ་པའི་གཟུགས་དང་ལྡན་པ།
en: Following the Bodhisattva were eighty thousand chariots beautifully outfitted with lattices of golden bells, and with parasols, victory banners, and flags hoisted.

source: གོ་ཆ་སྲ་བ་བགོས་པ་བཞི་ཁྲི་ནི་བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བའི་ཕྱི་བཞིན་འདོང་བར་གྱུར་ཏོ།
en: Then came forty thousand imposing foot soldiers and heroes wearing strong armor.

source: །འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷ་གྲགས་པ་གྲགས་པ་ཆེ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་གྲངས་མེད་པ་དག་ནི་ནམ་མཁའི་དཀྱིལ་ནས་བཀོད་པ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་བྱེད་ཅིང་ཕྱི་བཞིན་འདོང་བར་གྱུར་ཏོ།
en: Uncountable billions of gods of the desire and form realms, hovering in the sky, made various types of offerings to the Bodhisattva and followed after him.

source: །ཤིང་རྟ་གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདུག་པར་གྱུར་པ་དེ་ཡང་འདོད་པ་ན་སྤྱོད་པའི་ལྷ་རྣམས་ཀྱིས་བཀོད་པ་ཆེན་པོ་དུ་མས་ལེགས་པར་བརྒྱན་པར་གྱུར་ཏོ།
en: The Bodhisattva himself rode in a chariot, which the gods of the desire realm had decorated with a great array of ornaments.

source: །ལྷའི་བུ་མོ་རྒྱན་ཐམས་ཅད་ཀྱིས་ཆས་པ་རིན་པོ་ཆེའི་ཕྲེང་བ་ཐོགས་པ་ཉིས་ཁྲི་ཤིང་རྟ་དེ་དྲངས་ཏེ་ལྷའི་བུ་མོ་གཉིས་ཀྱི་བར་དུ་ནི་མིའི་བུ་མོ་གཅིག་འདུག །མིའི་བུ་མོ་གཉིས་ཀྱི་བར་དུ་ནི་ལྷའི་བུ་མོ་གཅིག་འདུག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་མཐུས་ལྷའི་བུ་མོས་ཀྱང་མིའི་བུ་མོའི་དྲི་མི་ཞིམ་པ་མི་ཚོར།
en: Twenty thousand celestial maidens with ornate jewelry held up jewel garlands and guided the chariot. Between every two of the celestial maidens was a human maiden, and between every two human maidens was a celestial maiden. However, because of the power of the Bodhisattva, the celestial girls did not find the smell of the human girls displeasing.

source: མིའི་བུ་མོས་ཀྱང་ལྷའི་བུ་མོའི་གཟུགས་མཐོང་ན་བག་མེད་པར་མ་གྱུར་ཏོ།
en: Nor were the human maidens overwhelmed by the sight of the beautiful celestial maidens.

source: །དགེ་སློང་དག་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་ཤཱཀྱ་ལྔ་བརྒྱ་ཙམ་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཆེད་དུ་ཁྱིམ་ལྔ་བརྒྱ་ཕུབ་སྟེ།
en: Monks, in the city of Kapilavastu, five hundred Śākyas had constructed five hundred homes for the Bodhisattva.

source: དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་གྲོང་ཁྱེར་དེར་འཇུག་པའི་ཚེ། རང་རང་གིས་བྱས་པའི་ཁྱིམ་གྱི་སྒོར་འཁོད་དེ།
en: When the Bodhisattva entered the city, they stood in front of these houses with their hands folded.

source: ཐལ་མོ་སྦྱར་ནས་ལུས་གུས་པར་བཏུད་དེ་རིམ་གྲོ་དང་བཅས་པས་འདི་སྐད་དུ།
en: Bowing reverentially, they invited the Bodhisattva:

source: ཀྱེ་དོན་ཐམས་ཅད་གྲུབ་པ་འདིར་གཤེགས་སུ་གསོལ།
en: “Sarvārthasiddha, please come here!

source: ཀྱེ་ལྷའི་ལྷ་འདིར་གཤེགས་སུ་གསོལ།
en: God of Gods, please come here!

source: ཀྱེ་སེམས་ཅན་དག་པ་འདིར་གཤེགས་སུ་གསོལ།
en: Pure Being, please come here!

source: ཀྱེ་ཁ་ལོ་སྒྱུར་བ་དམ་པ་འདིར་གཤེགས་སུ་གསོལ།
en: Sublime Captain, please come here!

source: ཀྱེ་དགའ་ཞིང་བདེ་བ་དང་མཆོག་ཏུ་དགའ་བ་མཛད་པ་འདིར་གཤེགས་སུ་གསོལ།
en: Bringer of Pleasure, Joy, and Rapture, please come here!

source: ཀྱེ་སྨད་པ་མེད་པའི་གྲགས་པ་མངའ་བ་འདིར་གཤེགས་སུ་གསོལ།
en: You Who Are Renowned as Being beyond Reproach, please come here!

source: ཀྱེ་ཀུན་ནས་སྤྱན་མངའ་བ་འདིར་གཤེགས་སུ་གསོལ།
en: All-Seeing One, please come here!

source: ཀྱེ་མི་མཉམ་པ་དང་མཉམ་ཞིང་འདྲ་བ་མེད་པའི་ཡོན་ཏན་དང་གཟི་བརྗིད་མངའ་བ། མཚན་དང་དཔེ་བྱད་བཟང་པོས་ཡང་དག་པར་བརྒྱན་པའི་སྐུ་མངའ་བ་འདིར་གཤེགས་སུ་གསོལ་ཞེས་དེ་སྐད་འཛེར་ཏོ།
en: Peerless One beyond Equal, with your splendor, qualities, and body adorned with the major and minor signs, please come here!”

source: །དེ་ནས་རྒྱལ་པོ་ཟས་གཙང་མས་དེ་དག་ཐམས་ཅད་དང་འཐུན་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་དེ་ཀུན་ཏུ་ཡང་ཞུགས་པར་བྱས་ཏེ།
en: King Śuddhodana wanted to make everyone happy, so he took the Bodhisattva into all the houses.

source: ཟླ་བ་བཞི་ལོན་པ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱི་ཁྱིམ་དུ་ཞུགས་ཏེ་རིན་པོ་ཆེ་སྣ་ཚོགས་བཀོད་པ་ཞེས་བྱ་བའི་ཁང་བཟངས་ཆེན་པོ་དེར་བྱང་ཆུབ་སེམས་དཔའ་ཞུགས་པར་གྱུར་ཏོ། །
en: In this way it took four months before the Bodhisattva entered his actual residence, the palace known as Display of Gems.

source: དེ་ན་ཤཱཀྱ་རྒན་རབས་རྒན་རབས་རྣམས་འདུས་ཏེ་བགྲོས་པ། ཕན་པའི་སེམས་དང་། བྱམས་པའི་སེམས་ཀྱིས་ཡོན་ཏན་དང་ལྡན་པ་དང་། འཇམ་པ་དང་ལྡན་པར་བྱང་ཆུབ་སེམས་དཔའ་བཙའ་བ་དང་། བྱི་དོར་བྱ་བ་དང་། ཉམས་སུ་བླང་བར་སུས་ནུས་ཞེས་བྱས་པ་དང་། དེ་ན་ཤཱཀྱའི་བུ་མོ་ལྔ་བརྒྱ་ཙམ་སོ་སོ་ནས་འདི་སྐད་དུ་བདག་གིས་གཞོན་ནུའི་རིམ་གྲོ་བགྱིའོ།
en: Then the eldest of the elders of the Śākya clan gathered to discuss who among their women should be responsible for the upbringing, care, and nurturing of the Bodhisattva. They agreed that it should be a skilled and kind person who could care for him in a loving and altruistic atmosphere. Five hundred Śākya women came to volunteer, saying, “I will care for the prince!

source: །བདག་གིས་གཞོན་ནུའི་རིམ་གྲོ་བགྱིའོ་ཞེས་ཟེར་རོ།
en: Please let me take care of the prince.”

source: །དེ་ན་ཤཱཀྱ་ཆེས་འགྲས་ཆེས་འགྲས་པ་དེ་དག་ན་རེ་བུ་མོ་འདི་དག་ཐམས་ཅད་ནི་བྱིས་པ་གཞོན་ནུ་ཐོར་བུ་གཞོན་ནུ་ལ་གཟུགས་དང་ད་རལ་བབ་པས་རྒྱགས་ཤིང་དྲེགས་པ་ཡིན་པས་འདི་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་དུས་དུས་སུ་རིམ་གྲོ་བྱ་བ་མི་ནུས་སོ།
en: The eldest male and female Śākyas then argued, “All of these women are impetuous young girls, who are vain and proud because of their beauty and youth. Such women are incapable of caring for the prince and his needs.

source: །སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱི་གཞོན་ནུའི་སྲུ་མོ་སྟེ། འདིས་ནི་གཞོན་ནུ་བདེ་བ་དང་ལེགས་པར་སྐྱེད་པར་ནུས་སོ།
en: However, the prince’s maternal aunt Mahāprajāpatī Gautamī would be able to raise the prince so that he is happy and well.

source: །རྒྱལ་པོ་ཟས་གཙང་མ་ཡང་མཉེས་པར་ནུས་སོ།
en: She will also be able to please King Śuddhodana.”

source: །ཞེས་ཐམས་ཅད་གྲོས་གཅིག་ཏུ་འདུས་ཏེ། སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱི་དད་པར་བྱས་ནས།
en: Since everyone agreed with this suggestion, they encouraged Mahāprajāpatī Gautamī to take on this task.

source: སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱིས་གཞོན་ནུ་དེ་ལེགས་པར་བསྐྱེད་དོ།
en: And indeed Mahāprajāpatī Gautamī raised the prince well.

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་རིམ་གྲོར་མ་མ་སུམ་ཅུ་རྩ་གཉིས་བསྐོས་པར་གྱུར་ཏེ།
en: At that time thirty-two additional nurses were appointed to serve the Bodhisattva.

source: དེ་ལ་བརྒྱད་ནི་པང་ན་འཚོ་བའི་མ་མའོ། །བརྒྱད་ནི་ནུ་མ་སྣུན་པའི་མ་མའོ། །བརྒྱད་ནི་རྩེན་གྲོགས་ཀྱི་མ་མའོ། །བརྒྱད་ནི་དྲི་མ་འཕྱི་བའི་མ་མའོ།
en: Of these, eight would carry him, eight were nursemaids, eight were playmates, and eight were appointed to bathe him.

source: །དེ་ནས་རྒྱལ་པོ་ཟས་གཙང་མས་ཤཱཀྱའི་ཚོགས་ཐམས་ཅད་བསོགས་ཏེ་དཔྱད་པ། ཇི་ལྟ་གཞོན་ནུ་འདི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཞིག་ཏུ་འགྱུར་རམ་འོན་ཏེ་མ་ཡིན་གྱིས་རབ་ཏུ་འབྱུང་བའི་ཕྱིར་མངོན་པར་འབྱུང་ཞེས་དཔྱད་པ་དང་།
en: King Śuddhodana then gathered all of the Śākyas for a council and asked, “Will this prince be a universal monarch or will he instead depart from here as a renunciant?”

source: དེའི་ཚེ་རིའི་རྒྱལ་པོ་གངས་རིའི་ངོས་ལ་དྲང་སྲོང་ཆེན་པོ་ནག་པོ་ཞེས་བྱ་བ་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་ཞིག་སྣག་གི་ཚ་བོ་མིས་བྱིན་ཞེས་བྱ་བ་དང་ལྷན་ཅིག་ཏུ་འདུག་འདུག་པ་ལས་དེས་བྱང་ཆུབ་སེམས་དཔའ་བཙས་པའི་ཚེ།
en: At that time the great sage Asita, who had the five extraordinary powers, was residing on the slopes of Himavat, the king of mountains, together with his sister’s son Naradatta.

source: ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོ་འཕྲུལ་མང་དུ་མཐོང་སྟེ། ནམ་མཁའི་དཀྱིལ་ན་ཡང་ལྷའི་བུ་མང་པོ་སངས་རྒྱས་ཀྱི་སྒྲ་སྒྲོག་ཅིང་གོས་ཀྱི་གཡབ་མོ་གཡོབ་པ་དང་། དགའ་ཞིང་ཕན་ཚུན་འདོང་བ་མཐོང་ནས། དེས་བསམས་པ། མ་ལ་བདག་གིས་རྣམ་པར་བལྟ་བ་ཞིག་ཏུ་བྱའམ་སྙམ་ནས། དེས་ལྷའི་མིག་གིས་འཛམ་བུའི་གླིང་ཐམས་ཅད་དུ་བལྟས་ན་སེར་སྐྱའི་གྲོང་ཁྱེར་ཆེན་པོ་དེ་ན་རྒྱལ་པོ་ཟས་གཙང་མའི་ཁྱིམ་དུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་གཟི་བརྗིད་ཀྱིས་གཟི་དང་ལྡན་པར་བྱས་པ།
en: When the Bodhisattva was born, he saw many amazing miraculous displays and he perceived many gods who joyfully hovered in the sky, waving banners and calling out, “Buddha!” Witnessing this, he thought to himself, “Excellent! I must see this!” With his divine eye, he looked all over Jambudvīpa and saw that a prince had been born to King Śuddhodana in the city of Kapilavastu.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཆོད་པ། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལུས་ལེགས་པར་བརྒྱན་པ་ཞིག་བཙས་པར་མཐོང་ནས།
en: It was a prince who shone with the light of merit, who was worshiped by everyone, and whose body was beautifully adorned with the thirty-two marks of a great being.

source: བྲམ་ཟེའི་ཁྱེའུ་མིས་བྱིན་ལ་སྨྲས་པ།
en: He said to the young priest Naradatta,

source: བྲམ་ཟེའི་ཁྱེའུ་ཤེས་པར་གྱིས་ཤིག །འཛམ་བུའི་གླིང་དུ་ནི་རིན་པོ་ཆེ་ཆེན་པོ་བྱུང་སྟེ།
en: “Young priest, listen! A jewel has come into this world!

source: སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན་རྒྱལ་པོ་ཟས་གཙང་མའི་ཁྱིམ་དུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་གཟི་བརྗིད་ཀྱིས་གཟི་དང་ལྡན་པར་བྱས་པ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཆོད་པ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པ་བཙས་སོ།
en: In the city of Kapilavastu, in the household of King Śuddhodana, a prince has been born. He shines with the light of merit, is worshiped by everyone, and is beautifully adorned with the thirty-two marks of a great being.

source: །དེ་གལ་ཏེ་ཁྱིམ་ན་གནས་ན་ནི་མཐའ་བཞི་ལ་དབང་བའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་ཏེ།
en: If he remains in his palace, he will become a universal monarch who commands the four armies.

source: རྣམ་པར་རྒྱལ་བ་དང་ལྡན་པ། ཆོས་དང་ལྡན་པ། ཆོས་ཀྱི་རྒྱལ་པོ་སྲིད་ཀྱི་མཐུ་སྟོབས་ཐོབ་པ།
en: He will be a victorious and pious Dharma king with the necessary strength to govern.
